{
  "title": "Kygo - Piano Jam For Studying and Sleeping[1 HOUR] [ORIGINAL]",
  "comments": [
    "Everyone is asking about the name and timestamp of each song. Heres the timestamp for each one:\r\n\r\n\r\nKygo - Piano Jam 1(For What Its Worth) : 00:00 - 02:56\r\nKygo - Piano Jam 2 : 02:57 - 05:32\r\nKygo - Piano Jam 3 : 05:33 - 08:46\r\nAnd then these 3 songs are on repeat til the end.\n\nSpotify Playlist: https://open.spotify.com/user/11178144529/playlist/4mQHKjwi3pCoOGePWFFHBW?si=HPSqbsBiSUKtidQI5fJ3JQ\n\n\nWould you like to play these Piano Jams by yourself ?\r\nThen go to our website http://pianosheets.net/ where you can find ALL the Kygo's Piano Jam Sheets",
    "This is simply perfect, great while studying",
    "Three years later! I’m still listening! This music is a Powerful Gift!",
    "I love Kygo's beats, and his piano play. This video on repeat is all I ever asked for in life. Thank you!",
    "I'm a professional piano player/keyboardist too - and I simply have to say: this is great! Thank you for these pieces!",
    "i first heard this on soundcloud around 5 years ago and i'm so happy to find it was still there. this hour version is just what i needed and i'm remembering those days that feel so long ago ",
    "I absolutely love this. I am in my first year of grad school and man it's been a doozy, and as I study for my finals this week this sequence has reminded me how far I have come as an individual, and how excited I am for the future for whatever may happen, oh and also helped me focus on my study material ;)   Thank you for this!",
    "I love this composition and set, I come back to it everytime I wanna work focusedly. Happy Christmas everyone, May your hearts be content. Thanks Kygo ",
    "La compañía perfecta para hacer mis tareas con  paz y tranquilidad. I LOVE YOU KYGO ",
    "I can't tell you how glad I am to have found this band but this wow just...",
    "Seriously, this is SO WONDERFUL!! I literally listened to it three times in a row yesterday, while editing my video. ABSOLUTELY LOVE THIS!!",
    "Love this loop so much... playing it every day and every night even before going to bed. ",
    "00:00 For What It's Worth\n02:57 Fading Light\n05:33 Intro",
    "I can not believe this exists. I am so pumped! I listen to Kygo and classical music every day and now they are combined! My life is now complete  Thank you times a million.",
    "This jam is special! It was the only music I listened to while writing my master thesis, and it was the most inspiring background for proper focus and research. Sincerely thank you for uploading it!",
    "Thank you for this! I've been studying to this, and it definitely helps reduce my stress:)",
    "This is all I listen to now when I'm studying. It's perfect.",
    "This music is amazing! So beautiful and perfect to play while I am doing my homework, helps me feel more positive and I can concentrate better. Thank you for this lovely music :)",
    "This song successfully got me through my studies for the past years! <3",
    "cellos and strings starting at 2:00 hits on a soul level, just so damn beautiful.",
    "I can't explain how effectively this has helped me. Thank you Kygo you're the best!",
    "Великолепно! Блестяще!️",
    "This is a beautiful track, but there's no way I'd be able to fall asleep to it. It energises me - mostly about wanting to be able to play it on piano!",
    "Thank you SO much for this beautiful calming music! I was having an overwhelming start to my day and couldn't calm my mind. found this and I am back to being super productive & mind is focused again. THANK YOU!",
    "I will listen to this the night before my exam next week. It's relaxing to listen to during a quiet evening alone.",
    "Love these piano pieces!! So beautiful and full of emotion",
    "Listening to this while I'm on my transition journey.... my background music while studying, relaxing after long hours shift at work.. when I was lost between decisions, when overwhelmed with many things.. such a happy song, fires me up every time!!",
    "Kygo is timeless and so is this track ",
    "Beautiful piece of music, creates a calm positive mood.",
    "Kygo's piano jams are so calming and theraputic. Love them.",
    "I love it and I love it. I'm studying, just understand everything with an awesome rhythm. Thank you very much!",
    "Ваши мелодии вдохновляют!!!Фантастика!!!Спасибо!!!",
    "As I struggle to decide between studying and sleeping. Definitely works both ways. Good one Kygo",
    "This mix gives me such an amazing feeling while I'm reading..Loving it! Pure gem!",
    "súper relajante!  me encanta ",
    "Amei esse som! Muitoooooooooooooo",
    "Perfect to listen when I work! Thanks to be so nice ! :) Your music is awesome",
    "Обожаю эту тему!",
    "Buenísima! totalmente relajante e inspirador "
  ]
}