{
  "title": "Nebula | Marvel Studios' Legends",
  "comments": [
    "Nebula journey has been crazy... I went from not liking her to adoring her",
    "From a Villan to An Avenger A Guardian and finally a protector of Knowhere taking care of those children and Drax. Nebula has came a long way. One of the well written characters in MCU.",
    "Nebula instantly became my one of most favourite characters when she said 'I just wanted sister'.",
    "One of the best marvel anti heroes who turned heroes with good writing. She is really marvelous",
    "Nebula has always been one of my favourite MCU characters, thanks to Karen Gillan's honest,  endearing and heart-rending portrayal of this tragic figure. Hope we get to see more of her in the future! ",
    "3:47 That Nebula \" Knock it off! \" scene where Peter Quill looks at Nebula as if he's trying to get him a new girlfriend is absolutely super funny moment.(and also her cool laugh too) ",
    "Nebula is 100% my favourite Guardian and Avenger. Love her so much!",
    "Karen Gillan deserves an Oscar for her role as Nebula. She makes this multi-faceted character totally believable.",
    "Nebula is simply a product of good writing. Just love her since Infinity War.",
    "These LEGENDS for the GOTG so far have been way more emotional than any of the previous LEGENDS",
    "One of my favorite MCU scenes was when Tony and Nebula were playing finger football.  She’s always been understated as a character.",
    "Nebula’s character arc was very good!! She had an amazing storyline in Endgame!!",
    "Nebula character just kept getting better over time. She was so amazing in this last movie. Great character",
    "One of my favourite characters in the MCU. Her development and arc through the years has been fun to watch",
    "This is the one I was waiting for, such a great character that I hope somehow sticks around in the mcu after vol 3, I doubt it but seeing a Nebula more at peace with herself is so rewarding to watch",
    "Nebula gets better each time she appears and hope she gets a lot of time to shine in Guardians Vol 3.",
    "Nebula is an awesome character. Her character's journey is the most interesting, the way the evolved is the most credible, and Karen Gillan is equally awesome. Her character is almost the main character of the third GotG, and it works so well.",
    "She deserve a series... bcos we don't know her past story...it's sem really interesting........make a series with her ....i want it...!",
    "nebula easily rose to become one of the most beloved characters since gotg2, and its a testament of how good her redemption arc was. not forced, and still reflects her original personality. but with an added ",
    "Nebula's character transformation has been the best in any MCU movies so far! I just love her and hope she finds her happiness!! ",
    "Nebula is one of my top three Marvel cinematic heroes. Her story is emotionally complex and intelligent and I live for that!!!",
    "Nebula is my favorite Guardian and I hope we get more of her in the future!",
    "Her and Mantis are definitely my favorite characters in GOTG ",
    "Nebula may not have gotten along with Gamora but her confession in the second guardians of the galaxy film was serious Gamora was the one who wanted to win while Nebula wanted a sister and I never considered that Thanos was torturing her every time Gamora prevailed I felt so bad for her and I am so glad that her and Gamora will always be sisters",
    "She's great! I really like her and hope to see more of her in the future.",
    "Nebula is one of the best characters in the MCU, hope after Vol 3, she returns to future MCU movies as avengers, solo or new guardians movies.",
    "Nebula is such an underrated queen the way she put aside her differences with gamora to take down the man who abused and used them was so empowering",
    "PERFECT ending , after all the pain it feels like a complete turn and new beginning, her life is far from over, it can have good final half with Quill and other experiences.",
    "Nebula is the toughest warrior and a good sister to gamora!",
    "The chemistry between Nebula & Peter in this movie sparks! I love it",
    "I loved Nebula the first moment I saw her on screen! There was just something about her body language and her heartless rage that caught my attention! If Marvel is going to give her a partner in the future it has to be Bucky or Suri..........dont ask me why but I can see her with either of those two!",
    "Nebula has the best character development in all MCU.",
    "After Gamora saying we are sisters,  and Nebula flew to Xander to avenge Thanos for Gamora despite knowing his capabilities . \n\nKiren perfected the role of Nebula , an anti-hero to one of the most loved character in MCU",
    "Nebula and Wanda hands down have the best character arc in the MCU remember she and rocket are the only certified avengers among the guardians\n\nThought they were going to show her in her quantum avengers suit, love that scene",
    "Nebula's the best Guardian, fight me",
    "Nebula has been a great Character.",
    "One of my favorite characters!",
    "Her father sensed her true pure heart and tried his hardest to break it, It didn't work,",
    "My favorite story arc in the MCU.",
    "Best actress too  she's really great with her lines and everything!",
    "Nebula is that one awkward friend you have only her friends understand her awkward qualities are the best thing about her.",
    "Nebula is perfect ",
    "I mean, she WAS one of the avengers during the blip in endgame. One of the best developed MCU characters.",
    "seeing her smile/laugh at the end of 3 was just......",
    "Karen owned this character. Another perfect casting. I didn’t really like her at first but she grew on me as she also started to find her place in the heroes’ corner — which was her place all along.",
    "From being a minor vilain to joining the AVENGERS themselves for their most important mission, it crazy development!",
    "\"All I ever wanted was a sister\"! Brought tears to me.\n\"HA HA HA Do not bring me into this,KNOCKKK IT OFFF\"! Sounds like me ",
    "one of the few villains that doesn't turn any less cooler when turned into the good side",
    "She's such a badass ",
    "That \" knock it off \" really git me.. lmaoo ",
    "Ella y Gamora son mis personajes femeninos favoritos del ucm",
    "Nebula and gamora are one of the most tragic mcu stories tbh",
    "Loved her scenes with Tony and Rocket too!Nebula rules! ",
    "Honestly, after volume 3, she and Rocket are my top two favorite Guardians.",
    "Nebula.. My the most favorite female character in whole MCU ",
    "Being the second and youngest myself Nebula has always been my favorite since the first time I seen her. And now I love her even more ",
    "What a brilliant recap edit cheers to the editors on this it’s textbook editing that nails the engagement. ",
    "Gracias por este video de este homenaje a nebula Me encantó mucho",
    "I'm really excited to see the movie!! <3",
    "I fell in luv with Nebula in the first Guardians. There's one scene where she storms out of a room and she yells to someone, \"Get out of my way!\" She's so mean",
    "2:05\nHits hard when you know her backstory (and seen all 3 gotg films...)",
    "This movie is top notch!! just watched it yesterday and I will watch it again!",
    "\"It would have been a waste of parts \" always gets me",
    "One of my fav character in MCU",
    "so happy to see hee having her own story episode",
    "She's been a star for a while. When Matt Smith was Dr who,she was a brilliant companion ",
    "I love you Nebula",
    "Her dry humor is PERFECTION. ️",
    "You will always be my Sister. -Gamora",
    "Nebula is my favourite character! ",
    "It was so hard to watch 'emilia pond' playing as Nebula, but she slammed a homerun on this, asbolute love her acting :D",
    "You cant talk about Nebula without mentioning Gamora. Truly they are intertwine",
    "I didnt even realise it was Karen until the 2nd movie  but that, I believe is because she is such a good actress ",
    "the moment she danced and laughed, i think, she finally find herself a family",
    "She so funny, the whole crew is so weird and funny, I love them",
    "Nebula said she hate her the least out of their siblings, what happened to them?",
    "each of GOTG embers deserved their own movies",
    "she has best development character.. love her from villain to be hero side",
    "From enemies to sisters",
    "the best character development ever!",
    "Karen Gillan is 100 percent the perfect casting for Nebula ",
    "Nebula journey has been crazy .. and  also Gamora 's journey",
    "That “Hurry up!” really hits me by her (Nebula) signature temper-facial expression we know. LOL.",
    "LOVE NEBULA BEST CHARACTER PERIODTTT",
    "I never thought that I would like Nebula before",
    "For me, Nebula kinda stole the show in Volume 3. Her and Mantis stories in this film are really great.",
    "She is one of the most complicated character in MCU.",
    "Can't wait for this movie!",
    "When I hear Nebula Say “You We’re The One Who Wanted To Win and I JUST WANTED A SISTER!” She Became My New Favorite MCU Character Close to Rocket Raccoon, Scarlet Witch, Spider-Man, Shang-Chi, Black Panther, Okoye and Groot.",
    "lol Nebula is just like a complete tsundere.. she deserve more!!",
    "She’s my favorite guardian.",
    "My favorite MCU character",
    "Nebula forever ",
    "I'm really looking forward to the movie coming out",
    "I remember when I watch the first guardians movie, her was the character that I most hate on the MCU, now she's one of my favorites ever",
    "nebula is to underrated! she is the strongest behind Gamora! makes sense, i mean they are both the adopted daughters of Thanos.",
    "I'm ready for Nebula movie.",
    "She became my favorite after she reformed.",
    "Nebula ",
    "“Family Reunion” is hilarious. ",
    "nebula is always my favorite ",
    "Nebula is my favorite character",
    "I like nebula more than gamora her journey is just more unpredictable.",
    "What a great  journey of Nebula  in the Guardians of the Galaxy  Franchises in the MCU.",
    "She is flawed in many ways, suffered from self pity and jealousy blinded by her desire to be noticed due to being asked to always prove herself, but deep down, her true nature, she has empathy, boosted by her own suffering and longing, which then turned her into someone who gives the kind of care that others are searching for just like her. She is very well written, unlike some woke female character.",
    "Nebula just wanted a sister and never wanted to see Gamora suffer so she lost every match against Gamora so her body doesn't have to be replaced like Nebula. Nebula loves Gamora like real sisters",
    "Happy ending by Nebula",
    "Nebula:- knock it off  love her",
    "she become 1 of my best MCU heroes",
    "Not bad for a character that apparently was supposed to die in  \"Endgame\"!\nI heard that Nebula would get a \"Betrayal and Redemption\" storyline. She allowed her \"Friends\" to be betrayed by her other self and got redemption by making the snap, proving to Thanos that SHE was the better \"Daughter\"!\n(but then RDJ decided to leave, and everything was changed!)\n",
    "Kare Gillan is gorgeous and has done an excellent job of portraying Nebula..",
    "Nebula is beautiful from reality",
    "I like her too much",
    "I LOVE Nebula",
    "hoping nebula is the new leader of GOG",
    "What about the scene of Tony Stark trying to teach Nebula a game when they were stranded in the space ship?",
    "Been watching her since Dr.Who as the girl who waited",
    "Wow. This Vid coinciding with her BattlePass release is just perfect.\n(Or... both are here because the Movie is soon)",
    "It’s the “Hurry up!” for me ",
    "they said Star-lord will return. which makes sence concidering where he is.\n\nBut i'd honestly rather see more of the current guardians adventures.",
    "I absolutely HATED Nebula at first. From the first 2 GOTG movies to the video game to the cartoon series, and even endgame, I never liked her. The character development just wasn’t enough for me to enjoy her. But the the third GOTG movie 100% changed my opinion. The more screen time she got, the more I fell in love with her character. I even started liking her more than Gamora. Nebula is definitely one of the best characters in the MCU, and to see her show more emotion and love in the third movie makes me so happy.",
    "finally a nebula arc",
    "My favorite Marvel characters: Scarlett Witch (Wanda Maximoff), Black Widow (Natasha Romanoff), and Nebula..... Virtual hug for Nebula ",
    "Apa gw doang disini yang skrg jadi ngeShip Nebula.. orang2 yang tipe penyayang tapi susah buat ngungakapin kayaknya pada suka deh",
    "Went from a total jerk too a beloved character",
    "I love this Karen",
    "Love nebula",
    "When it comes to the world of investing,most people don't know where to start. Fortunately, great investors of the past and present can provide us with guidance",
    "The adventures of Karen Gillian as Nebula",
    "Nebula ",
    "She can always join the Blue Man Group after GotG",
    "Nebula MVP",
    "Cranky death cyborg with a heart of gold.",
    "Nebula is my favourite character\nafter Rocket",
    "I was expecting a mini series……..but disappointingly got bamboozled",
    "Nice montage, but they skipped her entire arc in Endgame.",
    "nebula the goat fr",
    "She's Underated",
    "nobody gets her like i do ",
    "When is Mantis got her own movie or series?",
    "I'm going to see the Episode 3 again !",
    "Need to do a groot one",
    "I love her ",
    "Love from taiwan, i really want Nebula Karen Gillan get her own film.... she can act...and pretty too~",
    "This is how to make a hero. But Marvel nowadays they just do “ shehulk! She is stronger than hulk! She became hero by gettinga drop of blood!”",
    "Star Lord's New Lady Nebula! ",
    "best guardian",
    "She can laugh \n",
    "I legit have such a crush on her, idk what that says about me but I just love herrr",
    "She's a cyborg but she got no hair",
    "we want Mantis episode..",
    "Does this means guardians are over????",
    "Nebula saga",
    "My lovely gorgeous Nebula ",
    "Iron man GONE\nCaptain America GONE\nBlack Panther GONE\nnow Guardians Going\n\nwhy marvel why...",
    "great !",
    "i love u sm nebula",
    "Nebula is jumanji player in another multivers",
    "",
    "",
    "Gotg=guardians of the galaxy=greatest of the great",
    "The best",
    "Knock it off!!!!",
    "Nebula is SO AWESOME and SO HOT!",
    "Karen G was born to act as Nebula....",
    "",
    "2 volume i hate nebula, in volume 3, I love nebula, respect for the good Girl. \n\nLike yondu, come as bad person, become hero in the end.",
    "Live laugh love nebula",
    "My daughter ",
    "Get you're  ready",
    "",
    "you need to put when he playing with tony in dying ship",
    "Nebula and Amy Pond are one and the same",
    "I Do Why Peter Quill Was Fall With Nebula?",
    "knock it off! ",
    "Idk about legends I thought it was gonna say MARVELS AVENGERS. Fits better",
    "Knock it off ",
    "Nebula sister waitingg",
    "Oooo omg this better bee really ",
    "3:56 ",
    "Karen Gillan ",
    "Hi... \nDECODING\nMARVEL : Maarum VEL : Yuda with God Murugan mask \nGreen = Valli\nHer sister = Deivani\n\nEND OF WAR IN CINEMA\nEND OF WAR IN 9 MODE\n",
    "2023-05-07  FOUR DAYS AGO!?!  I went to see GOTG3 three days ago!  What's wrong with you?  Who's the bad advisor that decided to run this video one day before release day?  Oh well, the damage is done...where's the next video?",
    "What the hell? Where is the nebula's it's not ripe scene?",
    "The Swiss army knife nebula",
    "\"All are siblings\" ? ",
    "is it weird that I kinda ship her with quill in vol 3? ",
    "You haven't ruined Nebula yet.... please for the love of god up the CGI budget and dont ruin this wonderful character",
    "",
    "Önce lokiyi gönder lan",
    "Marvel legends is still a thing?",
    "I like angry women !",
    "She sounds like Katy Perry to me",
    "why gamora live again?",
    "I always thought she was hot. I like dark skinned girls.",
    "MISLEADING THUMBNAIL! \nThis is not a \"Full Episode\", it's a  teaser or trailer.\nMarvel Legends. Season 2 Episode 6, Nebula, Runtime 7 minutes. April 28th, 2023.  IMDB.",
    "Amy Pond!!!!!!!!!!!!!!!",
    "Nebula journey has been crazy... I went from not liking her to adoring her",
    "Ugh, this video isn't even her best clips.  I feel like Karen Gillan and James Gunn turned Nebula from Generic Henchman #5 into a character almost as interesting as Rocket and Mantis.",
    "the laar second ",
    "C'est quoi encore ce délire.",
    "Oh Davina Jaure why you such a bad day. /_\\",
    "It's not ripe.",
    "Hurry up ",
    "Wtf?",
    "This Marvel doesn't exist anymore",
    "Bruh",
    "First heee he yeah boyyy",
    "Karen ",
    "मेरी हिंदी भाषा कहां है",
    "Alrighty",
    "Nabilah",
    "First",
    "When will Disney stop promoting this movie",
    "Present 4 hours",
    "No thank you"
  ]
}